{
  "backend/main.mo": "Stores contact form submissions in a list and provides methods to submit and retrieve them.",
  "feature_evidence.json": "Lists implemented features, related files, components, test IDs, and confidence levels for build tracking.",
  "frontend-file-summaries.txt": "Provides short descriptions of various frontend files for reference or documentation.",
  "frontend/index.css": "Defines global Tailwind and OKLCH-based theme variables plus dark mode overrides.",
  "frontend/index.html": "Base HTML document with SEO meta tags and root div loading the main React entry script.",
  "frontend/src/App.tsx": "Main React app wiring providers, navigation state, and layout including Navbar, pages, and Footer.",
  "frontend/src/components/contact/ContactSection.tsx": "Contact form component with validation, submission handling, success state, and contact details UI.",
  "frontend/src/components/marketing/Footer.tsx": "Footer with quick links, smooth-scroll navigation, social icons, and branding elements.",
  "frontend/src/components/marketing/Navbar.tsx": "Responsive navbar enabling section scrolling, home/admin navigation, and mobile menu handling.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an about section with company description and value cards using icons and styled layout.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays a hero banner with background image, headline, description, and buttons that scroll to contact or services sections.",
  "frontend/src/components/sections/HowItWorksSection.tsx": "Shows a four-step explanation of the service process with numbered steps and icons.",
  "frontend/src/components/sections/JobRequirementsSection.tsx": "Lists job requirements for credit card sales roles in a grid of cards with icons and descriptions.",
  "frontend/src/components/sections/ServicesSection.tsx": "Presents three core services in card format with icons, descriptions, and an additional image.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing related queries when the actor changes.",
  "frontend/src/hooks/useContactSubmissions.ts": "Fetches all contact submissions from the backend using the actor once available.",
  "frontend/src/hooks/useDocumentMeta.ts": "Updates the document title and meta description on effect.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Submits contact form data via the backend actor and invalidates related queries on success.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes with custom color tokens.",
  "frontend/src/lib/validation/contactValidation.ts": "Validates contact form fields for required values, minimum lengths, and email format.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminSubmissionsPage.tsx": "Fetches and displays contact form submissions with loading, error, empty, and list states using styled cards.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage sections and sets SEO metadata for the Trustline Financial Services landing page.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugins for the site's design system.",
  "project_state.json": "Stores project metadata, features, requirements, and state version for build planning."
}